; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l12_p12_c12_g12_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(person-at person1 loc4)
	(person-at person2 loc12)
	(person-at person3 loc1)
	(person-at person4 loc5)
	(person-at person5 loc1)
	(person-at person6 loc7)
	(person-at person7 loc9)
	(person-at person8 loc10)
	(person-at person9 loc6)
	(person-at person10 loc6)
	(person-at person11 loc11)
	(person-at person12 loc8)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person7 food)
	(has-content-person person8 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person12 medicine)
))
)

; plan
1. (put-crate-in-carrier crate12 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space4)
   goals met: 1 of 13
2. (put-crate-in-carrier crate5 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space3)
   goals met: 1 of 13
3. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 0 of 13
4. (pick-and-drop crate5 loc12 drone1 carrier1 space3 person2 food)
   deleted: (crate-at-space crate5 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person2 food)
   goals met: 1 of 13
5. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 13
6. (put-crate-in-carrier crate4 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space3)
   goals met: 2 of 13
7. (move-carrier depot loc11 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   goals met: 1 of 13
8. (pick-and-drop crate4 loc11 drone1 carrier1 space3 person11 food)
   deleted: (crate-at-space crate4 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person11 food)
   goals met: 2 of 13
9. (move-carrier loc11 depot drone1 carrier1)
   deleted: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 13
10. (put-crate-in-carrier crate3 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space3)
   goals met: 3 of 13
11. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 2 of 13
12. (pick-and-drop crate12 loc10 drone1 carrier1 space4 person8 medicine)
   deleted: (crate-at-space crate12 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person8 medicine)
   goals met: 3 of 13
13. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 13
14. (put-crate-in-carrier crate11 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space4)
   goals met: 4 of 13
15. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 3 of 13
16. (pick-and-drop crate3 loc9 drone1 carrier1 space3 person7 food)
   deleted: (crate-at-space crate3 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person7 food)
   goals met: 4 of 13
17. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 13
18. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 5 of 13
19. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 4 of 13
20. (pick-and-drop crate11 loc8 drone1 carrier1 space4 person12 medicine)
   deleted: (crate-at-space crate11 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person12 medicine)
   goals met: 5 of 13
21. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 13
22. (put-crate-in-carrier crate10 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space4)
   goals met: 6 of 13
23. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 5 of 13
24. (pick-and-drop crate10 loc4 drone1 carrier1 space4 person1 medicine)
   deleted: (crate-at-space crate10 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person1 medicine)
   goals met: 6 of 13
25. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 13
26. (put-crate-in-carrier crate9 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space4)
   goals met: 7 of 13
27. (put-crate-in-carrier crate8 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space2)
   goals met: 7 of 13
28. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 6 of 13
29. (pick-and-drop crate8 loc6 drone1 carrier1 space2 person9 medicine)
   deleted: (crate-at-space crate8 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person9 medicine)
   goals met: 7 of 13
30. (pick-and-drop crate9 loc6 drone1 carrier1 space4 person10 medicine)
   deleted: (crate-at-space crate9 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person10 medicine)
   goals met: 8 of 13
31. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 13
32. (put-crate-in-carrier crate7 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space4)
   goals met: 9 of 13
33. (put-crate-in-carrier crate6 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space2)
   goals met: 9 of 13
34. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 8 of 13
35. (pick-and-drop crate6 loc5 drone1 carrier1 space2 person4 medicine)
   deleted: (crate-at-space crate6 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person4 medicine)
   goals met: 9 of 13
36. (pick-and-drop crate2 loc5 drone1 carrier1 space3 person4 food)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person4 food)
   goals met: 10 of 13
37. (move-carrier loc5 loc1 drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 10 of 13
38. (pick-and-drop crate7 loc1 drone1 carrier1 space4 person5 medicine)
   deleted: (crate-at-space crate7 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person5 medicine)
   goals met: 11 of 13
39. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 12 of 13
40. (put-crate-in-carrier crate1 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space4)
   goals met: 12 of 13
41. (move-carrier depot loc1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 11 of 13
42. (pick-and-drop crate1 loc1 drone1 carrier1 space4 person3 food)
   deleted: (crate-at-space crate1 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person3 food)
   goals met: 12 of 13
43. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 13 of 13
